{
  "stores": [
    {
      "id": 1,
      "name": "Park Row at Beekman St",
      "address": "38 Park Row",
      "city": "New York",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 2,
      "name": "Store Alcalá",
      "address": "Calle de Alcalá, 21",
      "city": "Madrid",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 3,
      "name": "Chambers and West Broadway",
      "address": "125 Chambers Street",
      "city": "New York",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 4,
      "name": "Covent Garden - Russell St",
      "address": "10 Russell Street",
      "city": "London",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    },
    {
      "id": 5,
      "name": "Monmouth St",
      "address": "11 Monmouth Street",
      "city": "London",
      "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Jabones"
    },
    {
      "id": 2,
      "name": "Shampoo"
    },
    {
      "id": 3,
      "name": "Acondicionadores"
    }
  ],
  "products": [
    {
      "id": 1,
      "name": "Jabón de Hierbaluisa (80 gr)",
      "price": 9,
      "description": "Nuestro jabón de hierbaluisa tiene propiedades antiinflamatorias, relajantes, antisépticas y antibacterianas. Ayuda con los problemas de acné y las infecciones de la piel.",
      "categoryId": 1,
      "stock": -7
    },
    {
      "id": 2,
      "name": "Jabón de Arroz y Bergamota (80 gr)",
      "price": 9,
      "description": "Nuestro jabón de harina de arroz con bergamota. Es ideal para regenerar la piel, eliminar manchas, rejuvenece y embellece el cutis. A su vez, el aceite esencial de bergamota ayuda a eliminar el exceso de grasa y prevenir las arrugas.",
      "categoryId": 1,
      "stock": 4
    },
    {
      "id": 3,
      "name": "Jabón de Naranja y Zanahoria (80 gr)",
      "price": 9,
      "description": "Nuestro jabón de naranja y zanahoria ayuda a eliminar toxinas, mejora el colágeno en la piel, es antiséptico, antiespasmódico y antidepresivo. La zanahoria le brinda propiedades antioxidantes ya que contiene vitamina C, también minimiza los poros, reduce espinillas y brinda brillo a la piel.",
      "categoryId": 1,
      "stock": -9
    },
    {
      "id": 4,
      "name": "Jabón de Manzanilla (80 gr)",
      "price": 9,
      "description": "Nuestro jabón de manzanilla es ideal para pieles sensibles y delicadas, contiene propiedades antiinflamatorias. Limpia, tonifica y suaviza. Ayuda con las enfermedades de la piel tales como psoriasis, rosácea, eczemas, acné y dermatitis. ",
      "categoryId": 1,
      "stock": 9
    },
    {
      "id": 5,
      "name": "Jabón de Maracuyá (80 gr)",
      "price": 9,
      "description": "Nuestro jabón de maracuyá contiene vitamina C lo cual ayuda a fortalecer la piel y aclararla, tiene propiedades antiinflamatorias, ayuda a controlar la grasa de la piel, hidrata y repara tejidos de la piel. Además, tiene propiedades tranquilizantes y desintoxicantes.",
      "categoryId": 1,
      "stock": 10
    },
    {
      "id": 6,
      "name": "Jabón de Limón (80 gr)",
      "price": 9,
      "description": "Nuestro jabón de limón contiene propiedades refrescantes y astringentes, también es un buen suavizante y revitaliza la piel. Elimina el exceso de grasa en la piel y tiene propiedades antisépticas. El limón ayuda a limpiar, eliminar impurezas y a tener una piel hidratada al mismo tiempo.",
      "categoryId": 1,
      "stock": 10
    },
    {
      "id": 7,
      "name": "Jabón de Café y Cacao (80 gr)",
      "price": 9,
      "description": "Nuestro jabón café y cacao es un excelente exfoliante, ayuda a estimular la circulación y combatir la celulitis. Por su parte la manteca de cacao da resistencia a la aparición de arrugas y tiene efectos protectores contra los rayos UV.",
      "categoryId": 1,
      "stock": 10
    },
    {
      "id": 8,
      "name": "Jabón de Avena y Miel (80 gr)",
      "price": 9,
      "description": "Nuestro jabón avena y miel tiene propiedades calmantes, hidratantes y antisépticas. Es muy recomendable para pieles sensibles o con afectaciones como la psoriasis y resequedad. La combinación de estos dos ingredientes aporta propiedades como la regeneración de la piel y limpia los poros.",
      "categoryId": 1,
      "stock": 10
    },
    {
      "id": 9,
      "name": "Shampoo para cabello graso (80 gr)",
      "price": 23,
      "description": "Nuestro shampoo para cabello graso contiene aceites que fortalecen, limpian y nutren el cabello a profundidad. Además, evitan el exceso de grasa y combaten la caspa, evitan el frizz y reparan las puntas abiertas. Contiene aceite esencial de lavanda, que ayuda a reducir la perdida del cabello, combate la caspa y su aroma tiene efecto relajante y anti-estrés.",
      "categoryId": 2,
      "stock": 10
    },
    {
      "id": 10,
      "name": "Shampoo para cabello seco (80 gr)",
      "price": 23,
      "description": "Nuestro shampoo para cabello seco contienen aceites que nutren, reparan las puntas quebradas, hidratan y gracias a su aporte de vitamina E, lo hace menos quebradizo. Es ideal para pieles sensibles. Además, estimula el crecimiento del cabello, fortalecimiento de los folículos pilosos y evitan el frizz. Contiene aceite esencial a naranja que, hidrata el cabello, elimina impurezas, aporta brillo y suavidad",
      "categoryId": 2,
      "stock": 10
    },
    {
      "id": 11,
      "name": "Shampoo para cabello mixto (80 gr)",
      "price": 23,
      "description": "Nuestro shampoo para cabello mixto contienen aceites que hidratan y nutren el cabello; reparan las puntas quebradas, gracias a su aporte de vitamina E, lo hace menos quebradizo. Limpia a profundidad la raíz e hidrata las puntas y evitando el frizz. Contiene aceite esencial de limón, que ayuda a eliminar el exceso de grasa en el cabelludo, regula el pH además, es un energizante natural, mejora el estado de animo y calma la ansiedad.",
      "categoryId": 2,
      "stock": 10
    },
    {
      "id": 12,
      "name": "Shampoo détox de carbón activado (80 gr)",
      "price": 23,
      "description": "El carbón activado limpia a profundidad el cuero cabelludo, elimina las toxinas, además, ayuda con algunas afecciones del cabello como la caspa. Asimismo, da volumen y brillo al cabello. Contiene aceites que estimulan el crecimiento del cabello y evitan la caída. Contiene aceite esencial a lavanda, que ayuda a reducir la perdida del cabello, combate la caspa y su aroma tiene efecto relajante y anti - estrés.",
      "categoryId": 2,
      "stock": 10
    },
    {
      "id": 13,
      "name": "Shampoo anti - caída (80 gr)",
      "price": 23,
      "description": "Formulado con aceites que fortalecen y nutren las raíces. Estimulan el crecimiento del cabello. Sus componentes ayudan al crecimiento de cabello mas grueso y fuerte ya que contienen omega 3. Contiene aceite esencial de romero y lavanda que estimulan el crecimiento de cabello y evita la caída",
      "categoryId": 2,
      "stock": 9
    },
    {
      "id": 14,
      "name": "Shampoo para cabello claro (80 gr)",
      "price": 23,
      "description": "Formulado con aceites que fortalecen y nutren las raíces. Estimulan el crecimiento del cabello. Contiene miel de abeja y extracto de manzanilla que darán a tu cabello claro unos lindos reflejos naturales evitando el oscurecimiento. Contiene aceite esencial de limón que refuerza la acción del extracto de la manzanilla para mantener tu cabello claro, además, refresca y revitaliza tu cabello, aportando brillo y suavidad.",
      "categoryId": 2,
      "stock": 9
    },
    {
      "id": 15,
      "name": "Acondicionador de Manteca de Karité (75 gr)",
      "price": 23,
      "description": "La manteca de karité tiene muchos beneficios sobre el cabello como hidratar, reparar, acondicionar, sirve muy bien sobre los rizos ya que tienen tendencia a ser secos. Nutre y estimula el crecimiento del cabello gracias a su gran cantidad de vitaminas y ácidos grasos naturales.",
      "categoryId": 3,
      "stock": 10
    },
    {
      "id": 16,
      "name": "Acondicionador de manteca de cacao (80 gr)",
      "price": 23,
      "description": "La manteca de cacao protege al cabello del daño, hidrata, es alto en vitamina E, lo que restaura y da elasticidad al cabello. Aporta brillo y suavidad al cabello y además disminuye el frizz. Evita la caída del cabello a causa de roturas y aporta volumen a los cabellos mas finos.",
      "categoryId": 3,
      "stock": 10
    }
  ],
  "orders": [
    {
      "id": 1,
      "name": "Dominicode",
      "date": "01/12/1995",
      "shippingAddress": "Av. de la Granvia de Hospitalet, 115",
      "city": "Barcelona",
      "pickup": true
    },
    {
      "name": "Dominicode",
      "shippingAddress": "",
      "city": "",
      "date": "6/11/2022",
      "isDelivery": true,
      "id": 2
    },
    {
      "name": "Dominicode",
      "store": {
        "id": 3,
        "name": "Chambers and West Broadway",
        "address": "125 Chambers Street",
        "city": "New York",
        "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
      },
      "date": "6/11/2022",
      "isDelivery": false,
      "id": 3
    },
    {
      "name": "Dominicode",
      "store": {
        "id": 4,
        "name": "Covent Garden - Russell St",
        "address": "10 Russell Street",
        "city": "London",
        "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
      },
      "date": "6/11/2022",
      "isDelivery": false,
      "id": 4
    },
    {
      "name": "Dominicode",
      "store": {
        "id": 3,
        "name": "Chambers and West Broadway",
        "address": "125 Chambers Street",
        "city": "New York",
        "openingHours": "10:00 - 14:00 and 17:00 - 20:30"
      },
      "date": "6/11/2022",
      "isDelivery": false,
      "id": 5
    }
  ],
  "detailsOrders": [
    {
      "id": 1,
      "orderId": 1,
      "quantity": 10,
      "productName": "Product name"
    },
    {
      "details": [],
      "orderId": 4,
      "id": 2
    },
    {
      "details": [],
      "orderId": 5,
      "id": 3
    }
  ]
}